---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalResourceReference
source: html/dbd1a1bb-2419-96be-f4e0-bea9c627cd9a.htm
---
# ExternalResourceReference Members

Creates a new ExternalResourceReference from the given ExternalResourceReference.